In [7]:
import pandas as pd 
df=pd.DataFrame({'Age':[23,32,41,36,53],'Income':[4000,6000,8000,7000,5000]})

In [8]:
df

   Age  Income
0   23    4000
1   32    6000
2   41    8000
3   36    7000
4   53    5000

### Simple Feature Scaling

In [9]:
df['Age_scale'] = df['Age']/df['Age'].max()
df['Income_scale'] = df['Income']/df['Income'].max()

In [10]:
df

   Age  Income  Age_scale  Income_scale
0   23    4000   0.433962         0.500
1   32    6000   0.603774         0.750
2   41    8000   0.773585         1.000
3   36    7000   0.679245         0.875
4   53    5000   1.000000         0.625

### Min Max Scaling

In [11]:
df['Age_min_ma'] = (df['Age']-df['Age'].min())/(df['Age'].max()-df['Age'].min())
df['Income_min_max'] = (df['Income']-df['Income'].min())/(df['Income'].max()-df['Income'].min())

In [12]:
df

   Age  Income  Age_scale  Income_scale  Age_min_ma  Income_min_max
0   23    4000   0.433962         0.500    0.000000            0.00
1   32    6000   0.603774         0.750    0.300000            0.50
2   41    8000   0.773585         1.000    0.600000            1.00
3   36    7000   0.679245         0.875    0.433333            0.75
4   53    5000   1.000000         0.625    1.000000            0.25

### Z score

In [15]:
df['Age_z_score'] = (df['Age']-df['Age'].mean())/(df['Age'].std())
df['Income_z_score'] = (df['Income']-df['Income'].mean())/(df['Income'].std())

In [16]:
df

,Age,Income,Age_scale,Income_scale,Age_min_ma,Income_min_max,Age_z_score,Income_z_score
0,23,4000,0.433962,0.500,0.000000,0.00,-1.259780,-1.264911
1,32,6000,0.603774,0.750,0.300000,0.50,-0.449921,0.000000
2,41,8000,0.773585,1.000,0.600000,1.00,0.359937,1.264911
3,36,7000,0.679245,0.875,0.433333,0.75,-0.089984,0.632456
4,53,5000,1.000000,0.625,1.000000,0.25,1.439748,-0.632456